<a href="https://colab.research.google.com/github/pranscript/ml_coursework/blob/master/Homework_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Import Statements

In [0]:
import pandas as pd
from google.colab import files
import io

**Train.csv and Test.csv loaded**

In [0]:
uploaded1 = files.upload()

In [0]:
uploaded2 = files.upload()

In [0]:
train_df = pd.read_csv(io.StringIO(uploaded1['train.csv'].decode('utf-8')))
test_df = pd.read_csv(io.StringIO(uploaded2['test.csv'].decode('utf-8')))

Datatypes of features

In [56]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Features in dataset

In [57]:
list(train_df.columns)

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

Count, mean, std, min, 25% percentile, 50% percentile, 75% percentile, max of
numerical features

In [61]:
perc =[.25, .50, .75] 
include =['float', 'int']
desc = train_df.describe(percentiles = perc, include = include)   
desc

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

Count, unique, top, freq of categorical features

In [62]:
include =['object']
desc2 = train_df.describe( include = include)   
desc2

                                Name   Sex    Ticket        Cabin Embarked
count                            891   891       891          204      889
unique                           891     2       681          147        3
top     Hegarty, Miss. Hanora "Nora"  male  CA. 2343  C23 C25 C27        S
freq                               1   577         7            4      644